# DSH_GetDSFieldsCount

## Description
Gets Object's Data Sheet fields count.

```pascal
FUNCTION DSH_GetDSFieldsCount(
				hObject      : HANDLE;
				dsName       : STRING;
				VAR outCount : INTEGER): BOOLEAN;
```

```python
def vs.DSH_GetDSFieldsCount(hObject, dsName):
    return (BOOLEAN, outCount)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|   |
|dsName|STRING|   |
|outCount|INTEGER|   |

## Version
Availability: from Vectorworks 2020.1

## Category
* Data Sheets